cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'heroku/brew'

brew 'cmake'
brew 'dos2unix'
brew 'gcc'
brew 'git'
brew 'heroku'
brew 'keychain'
brew 'nodejs'
brew 'python'
brew 'tmux'
brew 'todo-txt'
brew 'vim'

# Docker container setup, described here: https://pilsniak.com/how-to-install-docker-on-mac-os-using-brew/
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'xhyve'
brew 'docker-machine-driver-xhyve'
# End docker container setup

cask 'alfred'
cask 'anki'
cask 'dropbox'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'keybase'
cask 'scroll-reverser'
cask 'visual-studio-code'
