cask_args appdir: '/Applications'

tap 'azure/functions'
tap 'heroku/brew'
tap 'homebrew/bundle'

brew 'azure-cli'
brew 'azure-functions-core-tools'
brew 'bat'
brew 'cmake'
brew 'dos2unix'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'heroku'
brew 'keychain'
brew 'nodejs'
brew 'python'
brew 'tmux'
brew 'todo-txt'
brew 'vim'
brew 'z'

cask 'adoptopenjdk8'
cask 'alfred'
cask 'anki'
cask 'azure-data-studio'
cask 'docker'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'google-chrome'
cask 'hammerspoon'
cask 'homebrew/cask-versions/microsoft-remote-desktop-beta'
cask 'iterm2'
cask 'keybase'
cask 'kindle'
cask 'parallels'
cask 'postman'
cask 'powershell'
cask 'scroll-reverser'
cask 'signal'
cask 'visual-studio-code'
